نمایش کاراکترهای سفارشی روی نمایشگر LCD

هدف آزمایش

هدف از این آزمایش اینه که یاد بگیریم چطور روی LCD به جای حروف و اعداد معمولی، شکل‌ها و آیکون‌های دلخواه خودمون (مثل قلب یا تیک) رو بسازیم و نمایش بدیم.

قطعات استفاده شده

· برد آردوینو UNO
· نمایشگر LCD 16x2
· پتانسیومتر (برای تنظیم نور و وضوح صفحه)
· برد بورد
· سیم‌های جامپر
· کابل USB

توضیحات

بستن مدار:
طبق عکسی که از مدار داریم، پایه‌های LCD رو به آردوینو وصل کردیم. پایه‌های RS و EN به ترتیب به پین‌های ۱۲ و ۱۱ و پایه‌های داده (D4 تا D7) به پین‌های ۵، ۴، ۳ و ۲ وصل شدن. یه پتانسیومتر هم گذاشتیم که پایه وسطش به V0 ال‌سی‌دی وصله تا بتونیم کنتراست (وضوح) تصویر رو تنظیم کنیم. تغذیه ال‌سی‌دی هم به ۵ ولت و زمین (GND) آردوینو وصل شده.

کد چیکار می‌کنه؟
توی کد، ما ۴ تا شکل رو با استفاده از کدهای باینری (۰ و ۱) طراحی کردیم. بعد توی تابع setup، با دستور lcd.createChar به ال‌سی‌دی می‌گیم که این ۴ شکل رو توی حافظه‌ش ذخیره کنه. 
همون اول کار هم با دستور lcd.print عبارت "Custom Character" رو در خط اول می‌نویسیم. 
توی تابع loop هم با استفاده از lcd.setCursor جای دقیق هر شکل رو مشخص می‌کنیم و با lcd.write اون‌ها رو در خط دوم چاپ می‌کنیم. در نهایت با چرخوندن پتانسیومتر، تصویر روی صفحه کاملاً واضح و خوانا نمایش داده میشه.
